Praktikum_3/lab11_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->orderBy('tanggal', 'DESC')->findAll();