Praktikum_3/lab11_ci/ci4/app/Controllers/Home.php

SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
 LIMIT 3
---
    public function index()
    {
        $title = 'Beranda';
        $content = 'Selamat datang di halaman beranda!';

        $model = new ArtikelModel();
        $artikel = $model->orderBy('tanggal', 'DESC')->findAll();
        $artikel_terkini = $model->orderBy('tanggal', 'DESC')->findAll(3);