Praktikum_3 _Part2/lab11_ci/ci4/app/Cells/ArtikelTerkini.php

SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
 LIMIT 5
---
    public function render()
    {
        $model = new ArtikelModel();
        $artikel = $model->orderBy('tanggal', 'DESC')->limit(5)->findAll();