Praktikum_3 _Part2/lab11_ci/ci4/app/Controllers/Artikel.php

    public function index()
    {
        $model = new \App\Models\ArtikelModel();
        $kategori = $this->request->getGet('kategori');

        if ($kategori) {
            $artikel = $model->where('kategori', $kategori)->findAll();
        } else {
            $artikel = $model->findAll();
---
SELECT *
FROM `artikel`
WHERE `kategori` = 'hiburan'
SELECT *
FROM `artikel`
WHERE `kategori` = 'pendidikan'