Praktikum_5/lab11_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $model = new ArtikelModel();
        $kategori = $this->request->getGet('kategori');

        $artikel = $kategori
            ? $model->where('kategori', $kategori)->orderBy('tanggal', 'DESC')->findAll()
            : $model->orderBy('tanggal', 'DESC')->findAll();

SELECT *
FROM `artikel`
WHERE `slug` = 'Belajar-Asik-di-Era-Digital'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where(['slug' => $slug])->first();

SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'artikel' => $model->paginate(10),