Praktikum_5/lab11_ci/ci4/app/Controllers/Artikel.php

    public function index()
    {
        $model = new ArtikelModel();
        $kategori = $this->request->getGet('kategori');

        $artikel = $kategori
            ? $model->where('kategori', $kategori)->findAll()
            : $model->findAll();
---
SELECT *
FROM `artikel`