Praktikum_5/lab11_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%industri%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%industri%' ESCAPE '!'
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->like('judul', $q)->paginate(10),